In [1]:
import pandas as pd
products = [
    {"Name" : "คีย์บอร์ต" , "category" : "อุปกรณ์คอม" , "Price" : 500},
    {"Name" : "เมาส์", "category" : "อุปกรณ์คอม" , "Price" : 300},
    {"Name" : "ตุ๊กตา", "category" : "ของเล่น", "Price" :900 },
    {"Name" : "ทุเรียน" , "category" : "ผลไม่" , "Price":70}
]

In [2]:
a=pd.DataFrame(products)
a

        Name    category  Price
0  คีย์บอร์ต  อุปกรณ์คอม    500
1      เมาส์  อุปกรณ์คอม    300
2     ตุ๊กตา     ของเล่น    900
3    ทุเรียน       ผลไม่     70

In [3]:
a.set_index(["Price"],inplace=True)
a

            Name    category
Price
500    คีย์บอร์ต  อุปกรณ์คอม
300        เมาส์  อุปกรณ์คอม
900       ตุ๊กตา     ของเล่น
70       ทุเรียน       ผลไม่

In [6]:
products2 = [
    {"Name" : "คีย์บอร์ต" , "Name" : "อุปกรณ์คอม1" , "Price" : 500},
    {"Name" : "เมาส์", "category" : "อุปกรณ์คอม" , "Price" : 300},
    {"Name" : "ตุ๊กตา", "category" : "ของเล่น", "Price" :900 },
    {"Name" : "ทุเรียน" , "category" : "ผลไม่" , "Price":70}
]
a=pd.DataFrame(products2)
a

          Name  Price    category
0  อุปกรณ์คอม1    500         NaN
1        เมาส์    300  อุปกรณ์คอม
2       ตุ๊กตา    900     ของเล่น
3      ทุเรียน     70       ผลไม่